gdg-museum-api/app/controllers/arts_controller.rb

  def index
    @arts = Art.all
---
SELECT "arts".* FROM "arts"

  def create
    @art = Art.new(art_params)

    respond_to do |format|
      if @art.save
---
INSERT INTO "arts" ("created_at", "image", "minor", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 16 May 2014 14:15:46 BRT -03:00], ["image", "monalisa.jpg"], ["minor", "1"], ["name", "Monalisa"], ["updated_at", Fri, 16 May 2014 14:15:46 BRT -03:00]]

  def update
    respond_to do |format|
      if @art.update(art_params)
---
UPDATE "arts" SET "region_id" = $1, "updated_at" = $2 WHERE "arts"."id" = 1  [["region_id", 1], ["updated_at", Fri, 16 May 2014 14:18:16 BRT -03:00]]

    def set_art
      @art = Art.find(params[:id])
---
SELECT "arts".* FROM "arts" WHERE "arts"."id" = $1 LIMIT 1  [["id", "1"]]