gdg-museum-api/app/controllers/museums_controller.rb

  def index
    @museums = Museum.all
---
SELECT "museums".* FROM "museums"

  def create
    @museum = Museum.new(museum_params)

    respond_to do |format|
      if @museum.save
---
INSERT INTO "museums" ("created_at", "name", "updated_at", "uuid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 16 May 2014 14:04:32 BRT -03:00], ["name", "Arte Moderna"], ["updated_at", Fri, 16 May 2014 14:04:32 BRT -03:00], ["uuid", "B9407F30-F5F8-466E-AFF9-25556B57FE6D"]]

    def set_museum
      @museum = Museum.find(params[:id])
---
SELECT "museums".* FROM "museums" WHERE "museums"."id" = $1 LIMIT 1  [["id", "1"]]