gdg-museum-api/app/controllers/regions_controller.rb

SELECT "regions".* FROM "regions"
---
  def index
    @regions = Region.all

INSERT INTO "regions" ("created_at", "major", "museum_id", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 16 May 2014 14:09:36 BRT -03:00], ["major", "1"], ["museum_id", 1], ["name", "Japão"], ["updated_at", Fri, 16 May 2014 14:09:36 BRT -03:00]]
---
  def create
    @region = Region.new(region_params)

    respond_to do |format|
      if @region.save

SELECT "regions".* FROM "regions" WHERE "regions"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_region
      @region = Region.find(params[:id])