gdg-museum-api/app/views/arts/_form.html.erb

SELECT "regions".* FROM "regions"
---
    <%= f.label :region_id %><br>
    <%= f.select :region_id, options_for_select(Region.all.map{|r|[r.name, r.id]}) %>