gdg-museum-api/app/views/regions/_form.html.erb

SELECT "museums".* FROM "museums" ORDER BY "museums"."id" ASC LIMIT 1
---
    <%= f.label :museum_id %><br>
    <%= f.select :museum_id, options_for_select(Museum.all.map{|m|[m.name, m.id]}) %>